use mermaid to instead of table
